Revit 2026 API

# AssemblyViewUtilsCreatePartList Method

---

|  | Name | Description |
| --- | --- | --- |
|  | CreatePartList(Document, ElementId) | Creates a new part list multicategory schedule assembly view for the assembly instance. |
|  | CreatePartList(Document, ElementId, ElementId, Boolean) | Creates a new part list multicategory schedule assembly view for the assembly instance. |

#### Reference

AssemblyViewUtils Class

Autodesk.Revit.DB Namespace